In [52]:
import pandas as pd

In [53]:
# read data
df = pd.read_csv('/home/freitas/Downloads/internet2/data/IEx_2014_2020.csv',sep=';')
df.head()
print(df.shape)

(1048567, 7)

In [54]:
df.columns

Index(['AN_EXERCICIO', 'ST_ATUALIZADA', 'IEX', 'CNPJ', 'CO_MUNICIPIO_IBGE',
       'NO_MUNICIPIO', 'SG_UF'],
      dtype='object')

In [55]:
print(len(df['CNPJ'].unique()))

102008

In [56]:
df.dtypes

AN_EXERCICIO          int64
ST_ATUALIZADA         int64
IEX                  object
CNPJ                 object
CO_MUNICIPIO_IBGE     int64
NO_MUNICIPIO         object
SG_UF                object
dtype: object

In [57]:
# remove characters from CNPJ
df['CNPJ'] = df['CNPJ'].str.replace('.','')
df['CNPJ'] = df['CNPJ'].str.replace(',','')

/tmp/ipykernel_10665/1759745971.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['CNPJ'] = df['CNPJ'].str.replace('.','')

In [59]:
# convert CNPJ to float
df['CNPJ'] = df['CNPJ'].astype(float)
df['CNPJ'] = df['CNPJ'].astype(int)
df.dtypes

AN_EXERCICIO          int64
ST_ATUALIZADA         int64
IEX                  object
CNPJ                  int64
CO_MUNICIPIO_IBGE     int64
NO_MUNICIPIO         object
SG_UF                object
dtype: object

In [60]:
df = df.drop_duplicates()
df.rename(columns={'AN_EXERCICIO':'ANO'}, inplace=True)

In [61]:
df = df[['ANO','CNPJ','IEX']]
df.head()

    ANO                CNPJ          IEX
0  2014  403325000000000000  8,477606355
1  2014  404599000000000000           10
2  2014  450893000000000000  9,999990785
3  2014  401255000000000000           10
4  2014  400518000000000000            0

In [64]:
escola = pd.read_csv('/home/freitas/Downloads/internet2/data/Chave_escolas_censo.csv')
escola = escola[['CO_ESCOLA','NU_CGC_ENTIDADE']]
escola.rename(columns={'NU_CGC_ENTIDADE':'CNPJ'},inplace=True)
escola.head()

   CO_ESCOLA            CNPJ
0   41144287  80619661000139
1   41145518  81883621000162
2   41353242  80612815000160
3   41359232   1794067000108
4   41361261   1572770000171

In [65]:
merge_iex_escola = pd.merge(df, escola, on='CNPJ', how='left')
merge_iex_escola

          ANO                CNPJ          IEX  CO_ESCOLA
0        2014  403325000000000000  8,477606355        NaN
1        2014  404599000000000000           10        NaN
2        2014  450893000000000000  9,999990785        NaN
3        2014  401255000000000000           10        NaN
4        2014  400518000000000000            0        NaN
...       ...                 ...          ...        ...
1005421  2021  751382000000000000            0        NaN
1005422  2021  750916000000000000            0        NaN
1005423  2021  562379000000000000            0        NaN
1005424  2021  750915000000000000            0        NaN
1005425  2021  750914000000000000            0        NaN

[1005426 rows x 4 columns]

In [66]:
merge_iex_escola.isna().sum()

ANO                0
CNPJ               0
IEX                0
CO_ESCOLA    1004837
dtype: int64

In [ ]:
#df = pd.read_csv('/home/freitas/Downloads/internet2/data/censo_2014_2020.csv')
#df.head()

,NU_ANO_CENSO,SG_UF,CO_ENTIDADE,CO_MUNICIPIO,TP_SITUACAO_FUNCIONAMENTO,TP_DEPENDENCIA,TP_LOCALIZACAO,IN_LOCAL_FUNC_GALPAO,IN_PREDIO_COMPARTILHADO,IN_AGUA_REDE_PUBLICA,...,IN_QUADRA_ESPORTES,IN_SALA_DIRETORIA,IN_SECRETARIA,IN_COMPUTADOR,IN_EQUIP_COPIADORA,IN_EQUIP_IMPRESSORA,IN_INTERNET,IN_BANDA_LARGA,IN_REGULAR,IN_EJA
0,2014,RO,11022558,1100015,1,2,2,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
1,2014,RO,11024275,1100015,1,2,1,0.0,0.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,0.0,1.0
2,2014,RO,11024291,1100015,1,3,2,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
3,2014,RO,11024372,1100015,1,3,2,0.0,1.0,0.0,...,1.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0
4,2014,RO,11024593,1100015,1,3,2,0.0,1.0,0.0,...,1.0,0.0,0.0,1.0,1.0,1.0,0.0,NaN,1.0,0.0